TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2117/driverlib/empty_driverlib_src/ti/driverlib/dl_unicommi2ct.h
/*
 * Copyright (c) 2024, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_unicommi2ct.h
 *  @brief      Unified Communication Module (UNICOMM) - Inter-Integrated Circuit Target (I2CT) Driver Library
 *  @defgroup   UNICOMMI2CT Unified Communication Module (UNICOMM) - Inter-Integrated Circuit Target (I2CT)
 *
 *  @anchor ti_dl_dl_unicommi2ct_Overview
 *  # Overview
 *
 *  Unified Communication Module Inter-Integrated Circuit Target Driver Library allows
 *  full configuration of the UNICOMM I2CT module.
 *
 *  This Inter-Integrated Circuit Target (I2CT) module provides a standardized
 *  interface to transfer data, as a target, between devices and other external
 *  devices with the I2C interface.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup UNICOMMI2CT
 * @{
 */
#ifndef ti_dl_dl_unicommi2ct__include
#define ti_dl_dl_unicommi2ct__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>
#include <ti/driverlib/dl_unicomm.h>

#ifdef __MCU_HAS_UNICOMMI2CT__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/*!
 * @brief I2CT number of bytes which could be put into the TX FIFO
 *
 * This variable is device specific and is calculated using the system parameter
 * UNICOMMI2CT_SYS_FENTRIES defined in each devices header file.
*/
#define DL_I2CT_TX_FIFO_COUNT_MAXIMUM          ((uint32_t)UNICOMMI2CT_SYS_FENTRIES << 8)

/*!
 * @brief I2CT number of bytes which could be put into the RX FIFO
 *
 * This variable is device specific and is calculated using the system parameter
 * UNICOMMI2CT_SYS_FENTRIES defined in each devices header file.
*/
#define DL_I2CT_RX_FIFO_COUNT_MAXIMUM               ((uint32_t)UNICOMMI2CT_SYS_FENTRIES)

/** @addtogroup DL_I2CT_STATUS
 *  @{
 */

/*!
 * @brief Indicates the address for which address match happened
 */
#define DL_I2CT_STATUS_ADDRESS_MATCH             (UNICOMMI2CT_SR_ADDRMATCH_MASK)

/*!
 * @brief I2CT Stale TX FIFO
 *
 * Set = The TX FIFO data is stale. This occurs when the TX FIFO was not
 *   emptied during the previous I2CT transaction
 * Clear = The TX FIFO data is not stale
 */
#define DL_I2CT_STATUS_STALE_TX_FIFO          (UNICOMMI2CT_SR_STALE_TXFIFO_MASK)

/*!
 * @brief I2CT TX Mode
 *
 * Set = is in the TX_DATA, TX_ACK, TX_WAIT, or ADDR_ACK state with the
 *   bus direction set to read
 * Clear = is not in the TX_DATA, TX_ACK, TX_WAIT, or ADDR_ACK state
 *   with the bus direction set to read
 */
#define DL_I2CT_STATUS_TX_MODE                      (UNICOMMI2CT_SR_TXMODE_MASK)

/*!
 * @brief I2CT Bus Busy
 *
 * Set = The I2CT bus is busy. This is cleared on a timeout
 * Clear = The I2CT bus is not busy. This bit is cleared when a STOP condition is
 *   detected on the bus.
 */
#define DL_I2CT_STATUS_BUS_BUSY                     (UNICOMMI2CT_SR_BUSBSY_MASK)

/*!
 * @brief I2CT RX Mode
 *
 * Set = is in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK
 *   state with the bus direction set to write
 * Clear = is not in the RX_DATA, RX_ACK, RX_WAIT, RX_ACK_WAIT or ADDR_ACK
 *   state with the bus direction set to write
 */
#define DL_I2CT_STATUS_RX_MODE                      (UNICOMMI2CT_SR_RXMODE_MASK)


/*!
 * @brief Direction of I2CT Quick Command
 * Only valid when QCMDST is set. @sa DL_I2CT_STATUS_QUICK_COMMAND_STATUS.
 * Set = Quick command was a read
 * Clear = Quick command was a write
 */
#define DL_I2CT_STATUS_QUICK_COMMAND_READ_WRITE     (UNICOMMI2CT_SR_QCMDRW_MASK)

/*!
 * @brief Status of I2CT Quick Command
 * @sa DL_I2CT_STATUS_QUICK_COMMAND_READ_WRITE.
 * Set = Last transaction was a Quick Comand transaction
 * Clear = Last transaction was normal or has not occurred
 */
#define DL_I2CT_STATUS_QUICK_COMMAND_STATUS         (UNICOMMI2CT_SR_QCMDST_MASK)

/*!
 * @brief I2CT Own Address Alternate Matched
 */
#define DL_I2CT_STATUS_OWN_ADDR_ALTERNATE_MATCHED  (UNICOMMI2CT_SR_OAR2SEL_MASK)

/*!
 * @brief I2CT Transmit Request
 */
#define DL_I2CT_STATUS_TRANSMIT_REQUEST               (UNICOMMI2CT_SR_TREQ_MASK)

/*!
 * @brief I2CT Receive Request
 */
#define DL_I2CT_STATUS_RECEIVE_REQUEST                (UNICOMMI2CT_SR_RREQ_MASK)

/** @}*/

/** @addtogroup DL_I2CT_INTERRUPT
 *  @{
 */
/*!
 * @brief Receive Data Interrupt (byte has been received)
 */
#define DL_I2CT_INTERRUPT_RX_DONE      (UNICOMMI2CT_CPU_INT_IMASK_RXDONE_SET)

/*!
 * @brief Transmit Transaction completed Interrupt
 */
#define DL_I2CT_INTERRUPT_TX_DONE      (UNICOMMI2CT_CPU_INT_IMASK_TXDONE_SET)

/*!
 * @brief Receive FIFO Trigger
 */
#define DL_I2CT_INTERRUPT_RXFIFO_TRIGGER                                \
                                          (UNICOMMI2CT_CPU_INT_IMASK_RXTRG_SET)

/*!
 * @brief Transmit FIFO Trigger
 */
#define DL_I2CT_INTERRUPT_TXFIFO_TRIGGER                                \
                                          (UNICOMMI2CT_CPU_INT_IMASK_TXTRG_SET)

/*!
 * @brief RX FIFO full
 */
#define DL_I2CT_INTERRUPT_RXFIFO_FULL                                   \
                                         (UNICOMMI2CT_CPU_INT_IMASK_RXFULL_SET)

/*!
 * @brief TX FIFO empty. All data in Transmit FIFO shifted out and
 * transmit goes into idle mode.
 */
#define DL_I2CT_INTERRUPT_TXFIFO_EMPTY                                  \
                                            (UNICOMMI2CT_CPU_INT_IMASK_TXEMPTY_SET)

/*!
 * @brief Start Condition detected
 */
#define DL_I2CT_INTERRUPT_START                                         \
                                              (UNICOMMI2CT_CPU_INT_IMASK_START_SET)

/*!
 * @brief Stop Condition detected
 */
#define DL_I2CT_INTERRUPT_STOP           (UNICOMMI2CT_CPU_INT_IMASK_STOP_SET)

/*!
 * @brief General Call Interrupt
 */
#define DL_I2CT_INTERRUPT_GENERAL_CALL                                  \
                                            (UNICOMMI2CT_CPU_INT_IMASK_GENCALL_SET)

/*!
 * @brief DMA Done on Event 1 Publisher
 */
#define DL_I2CT_INTERRUPT_EVENT1_DMA_DONE                               \
                                        (UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_TX_SET)

/*!
 * @brief DMA Done on Event 2 Publisher
 */
#define DL_I2CT_INTERRUPT_EVENT2_DMA_DONE                               \
                                        (UNICOMMI2CT_CPU_INT_IMASK_DMA_DONE_RX_SET)


/*!
 * @brief SMBus/PMBus PEC Receive Error Interrupt
 */
#define DL_I2CT_INTERRUPT_PEC_RX_ERROR                                  \
                                         (UNICOMMI2CT_CPU_INT_IMASK_PEC_RX_ERR_SET)

/*!
 * @brief TX FIFO Underflow Interrupt
 */
#define DL_I2CT_INTERRUPT_TXFIFO_UNDERFLOW                              \
                                            (UNICOMMI2CT_CPU_INT_IMASK_TX_UNFL_SET)

/*!
 * @brief RX FIFO Overflow Interrupt
 */
#define DL_I2CT_INTERRUPT_RXFIFO_OVERFLOW                              \
                                            (UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_SET)

/*!
 * @brief Arbitration Lost Interrupt
 */
#define DL_I2CT_INTERRUPT_ARBITRATION_LOST                              \
                                            (UNICOMMI2CT_CPU_INT_IMASK_ARBLOST_SET)

/*!
 * @brief Interrupt Overflow Interrupt. Occurs when START or STOP
 *        interrupts overflow (i.e. occurs twice without being serviced)
 */
#define DL_I2CT_INTERRUPT_OVERFLOW   (UNICOMMI2CT_CPU_INT_IMASK_RX_OVFL_SET)

/*!
 * @brief Timeout A Interrupt
 */
#define DL_I2CT_INTERRUPT_TIMEOUT_A          (UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTA_SET)

/*!
 * @brief Timeout B Interrupt
 */
#define DL_I2CT_INTERRUPT_TIMEOUT_B          (UNICOMMI2CT_CPU_INT_IMASK_TIMEOUTB_SET)


/** @}*/

/** @addtogroup DL_I2CT_DMA_INTERRUPT
 *  @{
 */
/*!
 * @brief Peripheral Transmit FIFO Trigger interrupt for DMA trigger
 */
#define DL_I2CT_DMA_INTERRUPT_TXFIFO_TRIGGER                            \
                                          (UNICOMMI2CT_DMA_TRIG0_IMASK_TXTRG_SET)

/*!
 * @brief Peripheral Receive FIFO Trigger interrupt for DMA trigger
 */
#define DL_I2CT_DMA_INTERRUPT_RXFIFO_TRIGGER                            \
                                          (UNICOMMI2CT_DMA_TRIG1_IMASK_RXTRG_SET)

/** @}*/

/* clang-format on */

/** @enum DL_I2CT_EVENT_ROUTE */
typedef enum {
    /*! I2CT event route 1 */
    DL_I2CT_EVENT_ROUTE_1 = 0,
    /*! I2CT event route 2 */
    DL_I2CT_EVENT_ROUTE_2 = 12
} DL_I2CT_EVENT_ROUTE;

/** @enum DL_I2CT_CLOCK */
typedef enum {
    /*!  BUSCLK enabled as I2CT clock source */
    DL_I2CT_CLOCK_BUSCLK = UNICOMMI2CT_CLKSEL_BUSCLK_SEL_ENABLE,
    /*!  MFCLK enabled as I2CT clock source */
    DL_I2CT_CLOCK_MFCLK = UNICOMMI2CT_CLKSEL_MFCLK_SEL_ENABLE,
    /*!  Asynchronous SYSCLK enabled as I2CT clock source */
    DL_I2CT_CLOCK_ASYNC_SYSCLK = UNICOMMI2CT_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE,
    /*!  Asynchronous HFCLK enabled as I2CT clock source */
    DL_I2CT_CLOCK_ASYNC_HFCLK = UNICOMMI2CT_CLKSEL_ASYNC_HFCLK_SEL_ENABLE,
    /*!  Asynchronous PLL enabled as I2CT clock source */
    DL_I2CT_CLOCK_ASYNC_PLL = UNICOMMI2CT_CLKSEL_ASYNC_PLL_SEL_ENABLE,
} DL_I2CT_CLOCK;

/** @enum DL_I2CT_CLOCK_DIVIDE */
typedef enum {
    /*!  I2CT Clock Divided by 1 */
    DL_I2CT_CLOCK_DIVIDE_1 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_1,
    /*!  I2CT Clock Divided by 2 */
    DL_I2CT_CLOCK_DIVIDE_2 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_2,
    /*!  I2CT Clock Divided by 3 */
    DL_I2CT_CLOCK_DIVIDE_3 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_3,
    /*!  I2CT Clock Divided by 4 */
    DL_I2CT_CLOCK_DIVIDE_4 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_4,
    /*!  I2CT Clock Divided by 5 */
    DL_I2CT_CLOCK_DIVIDE_5 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_5,
    /*!  I2CT Clock Divided by 6 */
    DL_I2CT_CLOCK_DIVIDE_6 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_6,
    /*!  I2CT Clock Divided by 7 */
    DL_I2CT_CLOCK_DIVIDE_7 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_7,
    /*!  I2CT Clock Divided by 8 */
    DL_I2CT_CLOCK_DIVIDE_8 = UNICOMMI2CT_CLKDIV_RATIO_DIV_BY_8,
} DL_I2CT_CLOCK_DIVIDE;

/** @enum DL_I2CT_ADDRESSING_MODE */
typedef enum {
    /*! Enable in 7-bit addressing mode */
    DL_I2CT_ADDRESSING_MODE_7_BIT = UNICOMMI2CT_OAR_MODE_MODE7,
    /*! Enable in 10-bit addressing mode */
    DL_I2CT_ADDRESSING_MODE_10_BIT = UNICOMMI2CT_OAR_MODE_MODE10,
} DL_I2CT_ADDRESSING_MODE;

/** @enum DL_I2CT_PEC_STATUS */
typedef enum {
    /*!  I2CT SMBus/PMBus PEC was checked in the transaction that occurred
     *   before the last Stop */
    DL_I2CT_PEC_STATUS_CHECKED = UNICOMMI2CT_PECSR_PECSTS_CHECK_SET,
    /*!  I2CT SMBus/PMBus PEC was not checked in the transaction that
     *   occurred before the last Stop */
    DL_I2CT_PEC_STATUS_NOT_CHECKED = UNICOMMI2CT_PECSR_PECSTS_CHECK_CLEARED,
} DL_I2CT_PEC_STATUS;

/** @enum DL_I2CT_PEC_CHECK_ERROR */
typedef enum {
    /*!  Indicates PEC check error did not occurr in the transaction that
     *   occurred before the last Stop */
    DL_I2CT_PEC_CHECK_ERROR_CLEARED = UNICOMMI2CT_PECSR_PECSTS_ERROR_CLEARED,
    /*!  Indicates PEC check error occurred in the transaction that
     *   occurred before the last Stop */
    DL_I2CT_PEC_CHECK_ERROR_SET = UNICOMMI2CT_PECSR_PECSTS_ERROR_SET,
} DL_I2CT_PEC_CHECK_ERROR;

/** @enum DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH */
typedef enum {
    /*!  Pulses filtering disabled.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_DISABLED =
        UNICOMMI2CT_GFCTL_DGFSEL_DISABLED,
    /*!  Pulses shorter than 1 functional clock tick in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_1 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_1,
    /*!  Pulses shorter than 2 functional clock ticks in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_2 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_2,
    /*!  Pulses shorter than 3 functional clock ticks in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_3 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_3,
    /*!  Pulses shorter than 4 functional clock ticks in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_4 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_4,
    /*!  Pulses shorter than 8 functional clock ticks in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_8 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_8,
    /*!  Pulses shorter than 16 functional clock ticks in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_16 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_16,
    /*!  Pulses shorter than 31 functional clock ticks in length are filtered.  */
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH_CLOCKS_31 =
        UNICOMMI2CT_GFCTL_DGFSEL_CLK_31,
} DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH;

/** @enum DL_I2CT_TX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when FIFO <= 3/4 empty */
    DL_I2CT_TX_FIFO_LEVEL_3_4_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when FIFO <= 1/2 empty */
    DL_I2CT_TX_FIFO_LEVEL_1_2_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when FIFO <= 1/4 empty */
    DL_I2CT_TX_FIFO_LEVEL_1_4_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when FIFO is not full */
    DL_I2CT_TX_FIFO_LEVEL_ONE_ENTRY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_NOT_FULL,
    /*! Interrupt triggers when FIFO is empty */
    DL_I2CT_TX_FIFO_LEVEL_EMPTY = UNICOMMI2CT_IFLS_TXIFLSEL_LVL_EMPTY,
    /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
    DL_I2CT_TX_FIFO_LEVEL_ALMOST_EMPTY =
        UNICOMMI2CT_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
    /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
    DL_I2CT_TX_FIFO_LEVEL_ALMOST_FULL =
        UNICOMMI2CT_IFLS_TXIFLSEL_LVL_ALMOST_FULL
} DL_I2CT_TX_FIFO_LEVEL;

/** @enum DL_I2CT_RX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when FIFO >= 3/4 full */
    DL_I2CT_RX_FIFO_LEVEL_3_4_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when FIFO >= 1/2 full */
    DL_I2CT_RX_FIFO_LEVEL_1_2_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when FIFO >= 1/4 full */
    DL_I2CT_RX_FIFO_LEVEL_1_4_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when FIFO is not empty */
    DL_I2CT_RX_FIFO_LEVEL_ONE_ENTRY = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_NOT_EMPTY,
    /*! Interrupt triggers when FIFO is full */
    DL_I2CT_RX_FIFO_LEVEL_FULL = UNICOMMI2CT_IFLS_RXIFLSEL_LVL_FULL,
    /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
    DL_I2CT_RX_FIFO_LEVEL_ALMOST_FULL =
        UNICOMMI2CT_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
    /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
    DL_I2CT_RX_FIFO_LEVEL_ALMOST_EMPTY =
        UNICOMMI2CT_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY
} DL_I2CT_RX_FIFO_LEVEL;

/** @enum DL_I2CT_RESPONSE_OVERRIDE_VALUE */
typedef enum {
    /*!  manual ACK for valid data or command.  */
    DL_I2CT_RESPONSE_OVERRIDE_VALUE_ACK = UNICOMMI2CT_ACKCTL_ACKOVAL_DISABLE,
    /*!  manual NACK for invalid data or command.  */
    DL_I2CT_RESPONSE_OVERRIDE_VALUE_NACK = UNICOMMI2CT_ACKCTL_ACKOVAL_ENABLE,
} DL_I2CT_RESPONSE_OVERRIDE_VALUE;

/*! @enum DL_I2CT_IIDX */
typedef enum {
    /*! Interrupt index for I2CT if no interrupt is pending */
    DL_I2CT_IIDX_NO_INT = UNICOMMI2CT_IIDX_STAT_NO_INTR,
    /*! Interrupt index for I2CT Timeout A Event */
    DL_I2CT_IIDX_TIMEOUT_A = UNICOMMI2CT_IIDX_STAT_TIMEOUTA,
    /*! Interrupt index for I2CT Timeout B Event */
    DL_I2CT_IIDX_TIMEOUT_B = UNICOMMI2CT_IIDX_STAT_TIMEOUTB,

    /*! Interrupt index for I2CT Receive Data */
    DL_I2CT_IIDX_RX_DONE = UNICOMMI2CT_IIDX_STAT_RXDONEFG,
    /*! Interrupt index for I2CT Transmit Transaction completed */
    DL_I2CT_IIDX_TX_DONE = UNICOMMI2CT_IIDX_STAT_TXDONEFG,
    /*! Interrupt index for I2CT Receive FIFO Trigger */
    DL_I2CT_IIDX_RXFIFO_TRIGGER = UNICOMMI2CT_IIDX_STAT_RXTRG,
    /*! Interrupt index for I2CT Transmit FIFO Trigger */
    DL_I2CT_IIDX_TXFIFO_TRIGGER = UNICOMMI2CT_IIDX_STAT_TXTRG,
    /*! Interrupt index for I2CT RX FIFO full */
    DL_I2CT_IIDX_RXFIFO_FULL = UNICOMMI2CT_IIDX_STAT_RXFULL,
    /*! Interrupt index for I2CT TX FIFO empty.
     * All data in Transmit FIFO shifted out and transmit goes into idle mode. */
    DL_I2CT_IIDX_TXFIFO_EMPTY = UNICOMMI2CT_IIDX_STAT_TXEMPTY,
    /*! Interrupt index for I2CT Start Condition detected */
    DL_I2CT_IIDX_START = UNICOMMI2CT_IIDX_STAT_STARTFG,
    /*! Interrupt index for I2CT Stop Condition detected */
    DL_I2CT_IIDX_STOP = UNICOMMI2CT_IIDX_STAT_STOPFG,
    /*! Interrupt index for I2CT General Call */
    DL_I2CT_IIDX_GENERAL_CALL = UNICOMMI2CT_IIDX_STAT_GENCALL,
    /*! Interrupt index for I2CT Event 1 DMA Done */
    DL_I2CT_IIDX_EVENT1_DMA_DONE = UNICOMMI2CT_IIDX_STAT_DMA_DONE_TX,
    /*! Interrupt index for I2CT Event 2 DMA Done */
    DL_I2CT_IIDX_EVENT2_DMA_DONE = UNICOMMI2CT_IIDX_STAT_DMA_DONE_RX,
    /*! Interrupt index for I2CT receive pre-emptive interrupt */
    DL_I2CT_IIDX_PREEMPT_INT_TX = UNICOMMI2CT_IIDX_STAT_DMA_PREIRQ_TX,
    /*! Interrupt index for I2CT receive pre-emptive interrupt */
    DL_I2CT_IIDX_PREEMPT_INT_RX = UNICOMMI2CT_IIDX_STAT_DMA_PREIRQ_RX,
    /*! Interrupt index for I2CT SMBus/PMBus PEC Receive Error Event */
    DL_I2CT_IIDX_PEC_RX_ERROR = UNICOMMI2CT_IIDX_STAT_PEC_RX_ERR,
    /*! Interrupt index for I2CT TX FIFO underflow event */
    DL_I2CT_IIDX_TXFIFO_UNDERFLOW = UNICOMMI2CT_IIDX_STAT_TX_UNFL,
    /*! Interrupt index for I2CT RX FIFO overflow event */
    DL_I2CT_IIDX_RXFIFO_OVERFLOW = UNICOMMI2CT_IIDX_STAT_RX_OVFL,
    /*! Interrupt index for I2CT arbitration lost event */
    DL_I2CT_IIDX_ARBITRATION_LOST = UNICOMMI2CT_IIDX_STAT_ARBLOSTFG,

