TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2117/driverlib/empty_driverlib_src/ti/driverlib/dl_unicommi2ct.h
} DL_I2CT_IIDX;

/**
 * @brief  Configuration struct for @ref DL_I2CT_setClockConfig.
 */
typedef struct {
    /*! I2CT module clock source. One of @ref DL_I2CT_CLOCK */
    DL_I2CT_CLOCK clockSel;
    /*! I2CT clock divider selection. One of @ref DL_I2CT_CLOCK_DIVIDE */
    DL_I2CT_CLOCK_DIVIDE divideRatio;
} DL_I2CT_ClockConfig;

/**
 *  @brief      Configure I2CT source clock
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                       @ref DL_I2CT_ClockConfig.
 */
void DL_I2CT_setClockConfig(
    UNICOMM_Inst_Regs *unicomm, DL_I2CT_ClockConfig *config);

/**
 *  @brief      Get I2CT source clock configuration
 *
 *  @param[in]  unicomm    Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  config  Pointer to the clock configuration struct
 *                      @ref DL_I2CT_ClockConfig.
 */
void DL_I2CT_getClockConfig(
    UNICOMM_Inst_Regs *unicomm, DL_I2CT_ClockConfig *config);

/**
 *  @brief      Checks if TX FIFO is full
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO is full
 *
 *  @retval     true if TX FIFO is full
 *  @retval     false if TX FIFO is not full
 */
__STATIC_INLINE bool DL_I2CT_isTXFIFOFull(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_TXFF_MASK) ==
            UNICOMMI2CT_SR_TXFF_SET);
}

/**
 *  @brief      Checks if TX FIFO is empty
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If TX FIFO is empty
 *
 *  @retval     true if TX FIFO is empty
 *  @retval     false if TX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2CT_isTXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_TXFE_MASK) ==
            UNICOMMI2CT_SR_TXFE_SET);
}

/**
 *  @brief      Checks if RX FIFO is full
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO is full
 *
 *  @retval     true if RX FIFO is full
 *  @retval     false if RX FIFO is not full
 */
__STATIC_INLINE bool DL_I2CT_isRXFIFOFull(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_RXFF_MASK) ==
            UNICOMMI2CT_SR_RXFF_SET);
}

/**
 *  @brief      Checks if RX FIFO is empty
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If RX FIFO is empty
 *
 *  @retval     true if RX FIFO is empty
 *  @retval     false if RX FIFO is not empty
 */
__STATIC_INLINE bool DL_I2CT_isRXFIFOEmpty(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->SR & UNICOMMI2CT_SR_RXFE_MASK) ==
            UNICOMMI2CT_SR_RXFE_SET);
}

/**
 *  @brief      Fills the TX FIFO with data
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Pointer to buffer of bytes
 *  @param[in]  count   Number of bytes to fill TX FIFO from buffer
 *
 *  @return     Number of bytes that were successfully written
 */
uint8_t DL_I2CT_fillTXFIFO(
    UNICOMM_Inst_Regs *unicomm, uint8_t *buffer, uint8_t count);

/**
 *  @brief      Flushes/removes all elements in the TX FIFO
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
void DL_I2CT_flushTXFIFO(UNICOMM_Inst_Regs *unicomm);

/**
 *  @brief      Flushes/removes all elements in the RX FIFO
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
void DL_I2CT_flushRXFIFO(UNICOMM_Inst_Regs *unicomm);

/**
 *  @brief      Stop TX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2CT_isTXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_stopFlushTXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->IFLS &= ~(UNICOMMI2CT_IFLS_TXCLR_MASK);
}

/**
 *  @brief      Start TX FIFO flush
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_startFlushTXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->IFLS |= UNICOMMI2CT_IFLS_TXCLR_MASK;
}

/**
 *  @brief      Stop RX FIFO flush
 *
 *  Before stopping the flush, check if @ref DL_I2CT_isRXFIFOEmpty,
 *  indicating flush is complete.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_stopFlushRXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->IFLS &= ~(UNICOMMI2CT_IFLS_RXCLR_MASK);
}

/**
 *  @brief      Start RX FIFO flush
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_startFlushRXFIFO(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->IFLS |= UNICOMMI2CT_IFLS_RXCLR_MASK;
}

/**
 *  @brief  Transmit data, waiting until transmit request
 *
 *  @note   Setting own addresses and enabling should be done
 *  separately.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Byte of data to transmit
 */
void DL_I2CT_transmitDataBlocking(UNICOMM_Inst_Regs *unicomm, uint8_t data);

/**
 *  @brief  Transmit data
 *
 *  @note   Setting own addresses and enabling should be done
 *  separately.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  data    Byte of data to transmit
 *
 *  @return Whether data could be transmitted or not
 *  @retval true if data could be transmitted
 *  @retval false if data could not be transmitted
 */
bool DL_I2CT_transmitDataCheck(UNICOMM_Inst_Regs *unicomm, uint8_t data);

/**
 *  @brief  Receive data, waiting until receive request
 *
 *  @note   Setting own addresses and enabling should be done
 *  separately.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return Data received from
 */
uint8_t DL_I2CT_receiveDataBlocking(UNICOMM_Inst_Regs *unicomm);

/**
 *  @brief  Receive data
 *
 *  @note   Setting own addresses and enabling should be done
 *  separately.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  buffer  Pointer to where byte of received data should be stored
 *
 *  @return Whether data could be received or not
 *  @retval true if data could be received
 *  @retval false if data could not be received
 */
bool DL_I2CT_receiveDataCheck(UNICOMM_Inst_Regs *unicomm, uint8_t *buffer);

/**
 * @brief Enables power on UNICOMM I2C module
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_enablePower(UNICOMM_Inst_Regs *unicomm)
{
    DL_UNICOMM_enablePower(unicomm);
    if (unicomm->fixedMode == false) {
        DL_UNICOMM_setIPMode(unicomm, DL_UNICOMM_I2C_TARGET);
    }
}

/**
 * @brief Disables power on UNICOMM I2C module
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disablePower(UNICOMM_Inst_Regs *unicomm)
{
    DL_UNICOMM_disablePower(unicomm);
}

/**
 * @brief Returns if  power on UNICOMM I2C module
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 *
 * @return true if power is enabled
 * @return false if power is disabled
 */
__STATIC_INLINE bool DL_I2CT_isPowerEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return DL_UNICOMM_isPowerEnabled(unicomm);
}

/**
 * @brief Resets UNICOMM I2C peripheral
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_reset(UNICOMM_Inst_Regs *unicomm)
{
    DL_UNICOMM_reset(unicomm);
}

/**
 * @brief Returns if UNICOMM I2C peripheral was reset
 *
 * @param[in] unicomm        Pointer to the register overlay for the peripheral
 *
 * @return true if peripheral was reset
 * @return false if peripheral wasn't reset
 *
 */
__STATIC_INLINE bool DL_I2CT_isReset(UNICOMM_Inst_Regs *unicomm)
{
    return DL_UNICOMM_isReset(unicomm);
}

/**
 * @brief Set Clock Source
 *
 *  Clock sources depend on device and clock should be enabled
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  clockSource    One of @ref DL_I2CT_CLOCK.
 *
 */
__STATIC_INLINE void DL_I2CT_selectClockSource(
    UNICOMM_Inst_Regs *unicomm, DL_I2CT_CLOCK clockSource)
{
    DL_Common_updateReg(&unicomm->i2ct->CLKSEL, (uint32_t) clockSource,
        UNICOMMI2CT_CLKSEL_BUSCLK_SEL_MASK |
            UNICOMMI2CT_CLKSEL_MFCLK_SEL_MASK);
}

/**
 * @brief Set Clock Divider
 *
 *  @param[in]  unicomm            Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  clockDivider   One of @ref DL_I2CT_CLOCK_DIVIDE.
 *
 */
__STATIC_INLINE void DL_I2CT_selectClockDivider(
    UNICOMM_Inst_Regs *unicomm, DL_I2CT_CLOCK_DIVIDE clockDivider)
{
    DL_Common_updateReg(&unicomm->i2ct->CLKDIV, (uint32_t) clockDivider,
        UNICOMMI2CT_CLKDIV_RATIO_MASK);
}

/**
 *  @brief      Get Digital Glitch Suppression Pulse Width
 *
 *  Pulse width for the digital glitch suppression on SCL/SDA lines.
 *  Values are in terms of functional clock ticks.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Digital glitch suppression pulse width
 *
 *  @retval     One of @ref DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH
DL_I2CT_getDigitalGlitchFilterPulseWidth(UNICOMM_Inst_Regs *unicomm)
{
    uint32_t filterWidth =
        unicomm->i2ct->GFCTL & UNICOMMI2CT_GFCTL_DGFSEL_MASK;

    return (DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH)(filterWidth);
}

/**
 *  @brief      Set Digital Glitch Suppression Pulse Width
 *
 *  Pulse width for the digital glitch suppression on SCL/SDA lines.
 *  Values are in terms of functional clock ticks.
 *
 *  @param[in]  unicomm             Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  filterWidth     One of @ref DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH.
 */
__STATIC_INLINE void DL_I2CT_setDigitalGlitchFilterPulseWidth(
    UNICOMM_Inst_Regs *unicomm,
    DL_I2CT_DIGITAL_GLITCH_FILTER_WIDTH filterWidth)
{
    DL_Common_updateReg(&unicomm->i2ct->GFCTL, (uint32_t) filterWidth,
        UNICOMMI2CT_GFCTL_DGFSEL_MASK);
}

/**
 *  @brief      Disable Analog Glitch Suppression
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disableAnalogGlitchFilter(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->GFCTL &= ~(UNICOMMI2CT_GFCTL_AGFEN_MASK);
}

/**
 *  @brief      Checks if analog glitch suppression is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If analog glitch suppression is enabled
 *
 *  @retval     true if analog glitch suppression is enabled
 *  @retval     false if analog glitch suppression is disabled
 */
__STATIC_INLINE bool DL_I2CT_isAnalogGlitchFilterEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->GFCTL & UNICOMMI2CT_GFCTL_AGFEN_MASK) ==
            UNICOMMI2CT_GFCTL_AGFEN_ENABLE);
}

/**
 *  @brief      Enable Analog Glitch Suppression
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_enableAnalogGlitchFilter(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->GFCTL |= UNICOMMI2CT_GFCTL_AGFEN_ENABLE;
}

/**
 *  @brief      Set own address
 *
 * This field specifies bits A9 through A0 of the own address.
 *
 * In 7-bit addressing mode as selected by @ref DL_I2CT_setAddressingMode,
 * the top 3 bits are don't care
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  addr    Value of own address [0x00, 0x3FF]
 */
__STATIC_INLINE void DL_I2CT_setOwnAddress(
    UNICOMM_Inst_Regs *unicomm, uint32_t addr)
{
    DL_Common_updateReg(&unicomm->i2ct->OAR, addr, UNICOMMI2CT_OAR_OAR_MASK);
}

/**
 *  @brief      Get own address
 *
 * Get bits A9 through A0 of the own address.
 *
 * In 7-bit addressing mode as selected by @ref DL_I2CT_setAddressingMode,
 * the top 3 bits are don't care
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @return     own address
 *
 *  @retval     [0x00, 0x3FF]
 */
__STATIC_INLINE uint32_t DL_I2CT_getOwnAddress(UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->i2ct->OAR & UNICOMMI2CT_OAR_OAR_MASK);
}

/**
 *  @brief      Enable own address
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @sa DL_I2CT_setOwnAddress
 */
__STATIC_INLINE void DL_I2CT_enableOwnAddress(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->OAR |= UNICOMMI2CT_OAR_OAREN_ENABLE;
}

/**
 *  @brief      Disable own address
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_I2CT_disableOwnAddress(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->i2ct->OAR &= ~(UNICOMMI2CT_OAR_OAR_MASK);
}

/**
 *  @brief      Checks if own address is enabled
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     If own address is enabled
 *
 *  @retval     true if own address is enabled
 *  @retval     false if own address is disabled
 */
__STATIC_INLINE bool DL_I2CT_isOwnAddressEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->i2ct->OAR & UNICOMMI2CT_OAR_OAREN_MASK) ==
            UNICOMMI2CT_OAR_OAREN_ENABLE);
}

/**
 *  @brief      Set addressing mode
 *
 *  Selects the addressing mode to be used when device is configured as a
 *
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  mode    Addressing mode to set the to.
 *                      One of @ref DL_I2CT_ADDRESSING_MODE.
 */
__STATIC_INLINE void DL_I2CT_setAddressingMode(
    UNICOMM_Inst_Regs *unicomm, DL_I2CT_ADDRESSING_MODE mode)
{
    DL_Common_updateReg(
        &unicomm->i2ct->OAR, (uint32_t) mode, UNICOMMI2CT_OAR_MODE_MASK);
}

/**
 *  @brief      Get addressing mode
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *
 *  @return     Addressing mode the is set to
 *
 *  @retval     One of @ref DL_I2CT_ADDRESSING_MODE
 */
__STATIC_INLINE DL_I2CT_ADDRESSING_MODE DL_I2CT_getAddressingMode(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t mode = unicomm->i2ct->OAR & UNICOMMI2CT_OAR_MODE_MASK;

